Revit 2025 API
FamilyHostingBehavior Enumeration
 Types of hosts into/onto which a family can be hosted. For informative purposes only. Does not affect anything in Revit!
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum FamilyHostingBehavior
Public Enumeration FamilyHostingBehavior
public enum class FamilyHostingBehavior
type FamilyHostingBehavior
Members
Member name | Value | Description
None | 0
Wall | 1
Floor | 2
Ceiling | 3
Roof | 4
Face | 5
See Also
Reference
Autodesk.Revit.DB Namespace